
////////////////////////////////////////////////////////////////////////////////
// АРХИВ ZIP

&НаСервере
Процедура Упаковать()
	
	Сейчас = ТекущаяДата();

	// Создаём объект записи ZIP-архива
	ИмяАрхивногоФайла = ТекущийКаталог + "Файлы1С.zip";
	Комментарий = "в архиве содержатся папки и файлы, указанные в домашнем задании № 1";
	ЗаписьZIP = 
	Новый ЗаписьZipФайла(ИмяАрхивногоФайла, , Комментарий, , УровеньСжатияZIP.Максимальный, МетодШифрованияZIP.AES256);

	// Добавляем необходимые файлы в архив
	ОсновнойКаталог = ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("ОсновнойКаталог");
	ЗаписьZIP.Добавить("C:\Program Files\1cv8\8.3.23.1688\bin\*.hbk", РежимСохраненияПутейZIP.СохранятьОтносительныеПути);
	ЗаписьZIP.Добавить("C:\Program Files\1cv8\8.3.23.1688\readme\", РежимСохраненияПутейZIP.СохранятьОтносительныеПути);

	// Записываем архив на диск
	ЗаписьZIP.Записать();

	// Время, которое потребовалось для упаковки файлов
	Сообщения.ДобавитьСтроку("Упаковка заняла " + (ТекущаяДата() - Сейчас) + " секунд(ы)");		
	
КонецПроцедуры

&НаСервере
Процедура Распаковать()
	
	Сейчас = ТекущаяДата();

	// Открываем файл для чтения
	ИмяАрхивногоФайла = ТекущийКаталог + "Файлы1С.zip";
	ЧтениеZIP = Новый ЧтениеZipФайла(ИмяАрхивногоФайла);

	// Комментарий архива
	Сообщения.ДобавитьСтроку("Комментарий: " + ЧтениеZIP.Комментарий);

	// Достаем все файлы из архива
	ЧтениеZIP.ИзвлечьВсе("C:\ОД - ДЗ");
	ЧтениеZIP.Закрыть();

	// Время, которое потребовалось для распаковки файлов
	Сообщения.ДобавитьСтроку("Распаковка заняла " + (ТекущаяДата() - Сейчас) + " секунд(ы)");	
	
КонецПроцедуры



#Область ПРОЧЕЕ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийКаталог = 
	ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("ОсновнойКаталог") + "Вебинар 1\Обмен через zip-файлы\";
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийКаталогНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ТекущийКаталог);
	
КонецПроцедуры


&НаКлиенте
Процедура Команда_Упаковать(Команда)
	
	Сообщения.Очистить();
	Упаковать();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_Распаковать(Команда)
	
	Сообщения.Очистить();
	Распаковать();
	
КонецПроцедуры

#КонецОбласти
