
Функция ОстаткиТоваров(Дата) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ОстаткиТоваровОстатки.Номенклатура.Представление КАК НоменклатураПредставление
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(&ДатаОстатка, ) КАК ОстаткиТоваровОстатки";
	
	Запрос.УстановитьПараметр("ДатаОстатка", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаОстатков;

КонецФункции // ()
