
Функция ОстаткиТоваров(Дата) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Номенклатура.Представление КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ОстаткиТоваровОстатки.Номенклатура)) КАК Идентификатор,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(&ДатаОстатка, ) КАК ОстаткиТоваровОстатки";
	
	Запрос.УстановитьПараметр("ДатаОстатка", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаОстатков;

КонецФункции // ()

Функция СгенерироватьТокен() Экспорт
	
	АлгоритмПодписи = АлгоритмПодписиТокенаДоступа.HS256;
	ТокенДоступа = Новый ТокенДоступа;
	ТокенДоступа.Заголовки.Вставить("alg", Строка(АлгоритмПодписи));
	ТокенДоступа.Эмитент = "ssl";
	
	МассивПолучателей = Новый Массив;
	МассивПолучателей.Добавить("Exchange");
	ТокенДоступа.Получатели = МассивПолучателей;
	
	ТокенДоступа.КлючСопоставленияПользователя = "site";
	ТокенДоступа.ВремяСоздания = Дата(1,1,1) + ТекущаяУниверсальнаяДатаВМиллисекундах()/1000 - Дата(1970,1,1,1,0,0);
	ТокенДоступа.ВремяЖизни = 3153600;
	ТокенДоступа.Идентификатор = Новый УникальныйИдентификатор;
	ТокенДоступа.Подписать(АлгоритмПодписи, Base64Строка(ПолучитьДвоичныеДанныеИзСтроки("techcore")));
	
	Токен = Строка(ТокенДоступа);
	
	Возврат Токен;

КонецФункции // ()
