
////////////////////////////////////////////////////////////////////////////////
// ИНТЕРНЕТ-ПОЧТА

&НаКлиенте
Процедура ОбменФайлами_Отправить(Команда)
	
	Сообщения.Очистить();
	
	// Настройки вашего почтового ящика:
	УчетнаяЗапись = Новый ИнтернетПочтовыйПрофиль;
	УчетнаяЗапись.Пользователь       = "siod16@mail.ru";
	УчетнаяЗапись.Пароль             = "nutaQiUcyM7qsppVmKSq";
	
	УчетнаяЗапись.АдресСервераPOP3   = "pop.mail.ru";
	УчетнаяЗапись.АдресСервераSMTP   = "smtp.mail.ru";
	
	УчетнаяЗапись.ИспользоватьSSLPOP3 = Истина;
	УчетнаяЗапись.ПортPOP3 = 995;
	
	УчетнаяЗапись.ИспользоватьSSLSMTP = Истина;
	УчетнаяЗапись.ПортSMTP = 465;	
	
	УчетнаяЗапись.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	УчетнаяЗапись.ПользовательSMTP   = УчетнаяЗапись.Пользователь;
	УчетнаяЗапись.ПарольSMTP         = УчетнаяЗапись.Пароль;
	
	// Создание письма:
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Получатели.Добавить("siod16@mail.ru");
	Письмо.Получатели.Добавить("teacher1C@infostart.ru");
	
	Письмо.Отправитель.Адрес           = "siod16@mail.ru";
	Письмо.Отправитель.ОтображаемоеИмя = "Teacher";
	Письмо.Тема                        = "Письмо с файлами";
	Письмо.Тексты.Добавить("К письму приложены файлы!");
	
	// Прикрепление файлов к письму:
	ОсновнойКаталог = ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("ОсновнойКаталог");
	Файл1 = ОсновнойКаталог + "Вебинар 2\Обмен через html-документы\Пример HTML-документа\infostartru.png";
	Файл2 = ОсновнойКаталог + "Вебинар 2\Обмен через html-документы\Пример HTML-документа\logo.jpg";
	Письмо.Вложения.Добавить(Файл1);
	Письмо.Вложения.Добавить(Файл2);
	
	// Отправка письма с помощью объекта "ИнтернетПочта":
	ИнтернетПочта = Новый ИнтернетПочта;
	
	Попытка
		ИнтернетПочта.Подключиться(УчетнаяЗапись);
		
	Исключение
    	Сообщения.ДобавитьСтроку(ОписаниеОшибки());
    	Сообщения.ДобавитьСтроку("Произошли ошибки при проверке настроек учетной записи!");
    	Возврат;
	КонецПопытки;	
	
	ИнтернетПочта.Послать(Письмо);
	ИнтернетПочта.Отключиться();
	
	Сообщения.ДобавитьСтроку("Почтовое сообщение """ + Письмо.Тема + """ успешно отправлено!");	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменФайлами_Принять(Команда)
	
	Сообщения.Очистить();
	
	// Настройки вашего почтового ящика:
	УчетнаяЗапись = Новый ИнтернетПочтовыйПрофиль;
	УчетнаяЗапись.Пользователь       = "siod16@mail.ru";
	УчетнаяЗапись.Пароль             = "nutaQiUcyM7qsppVmKSq";
	
	УчетнаяЗапись.АдресСервераPOP3   = "pop.mail.ru";
	УчетнаяЗапись.АдресСервераSMTP   = "smtp.mail.ru";
	
	УчетнаяЗапись.ИспользоватьSSLPOP3 = Истина;
	УчетнаяЗапись.ПортPOP3 = 995;
	
	УчетнаяЗапись.ИспользоватьSSLSMTP = Истина;
	УчетнаяЗапись.ПортSMTP = 465;	
	
	УчетнаяЗапись.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	УчетнаяЗапись.ПользовательSMTP   = УчетнаяЗапись.Пользователь;
	УчетнаяЗапись.ПарольSMTP         = УчетнаяЗапись.Пароль;
	
	// Подключение к серверу:
	ИнтернетПочта = Новый ИнтернетПочта;
	
	Попытка
		ИнтернетПочта.Подключиться(УчетнаяЗапись);
		
	Исключение
    	Сообщения.ДобавитьСтроку(ОписаниеОшибки());
    	Сообщения.ДобавитьСтроку("Произошли ошибки при проверке настроек учетной записи!");
    	Возврат;
	КонецПопытки;	
	
	// Получение только заголовков писем (без содержимого писем):
	
	Отбор = Новый Структура;
	Отбор.Вставить("ПослеДатыОтправления", НачалоДня(ТекущаяДата()) - 86400);
	ЗаголовкиВсехПисем = ИнтернетПочта.ПолучитьЗаголовки(Отбор); // массив
	
	// По заголовку выбираем только нужные нам письма:
	НужныеПисьма = Новый Массив;
	Для каждого ТекущийЗаголовок Из ЗаголовкиВсехПисем Цикл
		Если ТекущийЗаголовок.Тема = "Письмо с файлами" Тогда
			НужныеПисьма.Добавить(ТекущийЗаголовок);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НужныеПисьма.Количество() = 0 Тогда
		Сообщения.ДобавитьСтроку("На почтовом сервере нет нужных нам писем с файлами!");
	Иначе
		
		// Полностью получаем нужное нам письмо (для примера - только первое из них):
		Письмо = ИнтернетПочта.Выбрать(Ложь, НужныеПисьма).Получить(0);
		
		// Сохраняем файлы из письма:
		Файл1 = Письмо.Вложения.Получить(0); // Первый по счету файл
		Файл1.Данные.Записать(ТекущийКаталог + Файл1.ИмяФайла);
		Сообщения.ДобавитьСтроку("Файл """ + Файл1.ИмяФайла + """ успешно сохранен в текущем каталоге!");
		
		Файл2 = Письмо.Вложения.Получить(1); // Второй по счету файл
		Файл2.Данные.Записать(ТекущийКаталог + Файл2.ИмяФайла);
		Сообщения.ДобавитьСтроку("Файл """ + Файл2.ИмяФайла + """ успешно сохранен в текущем каталоге!");
		
	КонецЕсли;
	
	// Завершение подключения:
	ИнтернетПочта.Отключиться();	
	
КонецПроцедуры



#Область ПРОЧЕЕ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийКаталог = 
	ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("ОсновнойКаталог") + "Вебинар 2\Передача файлов по e-mail\";
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийКаталогНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ТекущийКаталог);
	
КонецПроцедуры

#КонецОбласти
