
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийКаталог = 
	ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("ОсновнойКаталог") + "Вебинар 3\Подключение к другой 1С-базе\";

	
	///////////////////////////////////////////////////
	// СТРОКА СОЕДИНЕНИЯ (одинакова для COM и OLE):
	
	// - Для файлового варианта: "File=КАТАЛОГ;Usr=ПОЛЬЗОВАТЕЛЬ;Pwd=ПАРОЛЬ"
	КаталогБазы       = ТекущийКаталог + "База для подключения";
	Пользователь      = "";
	Пароль            = "";
	СтрокаСоединения  = "File=""" + КаталогБазы + """;Usr=" + Пользователь + ";Pwd=" + Пароль;
	
//	// - Для клиент-серверного варианта: "Srvr=КЛАСТЕР;Ref=БАЗА;Usr=ПОЛЬЗОВАТЕЛЬ;Pwd=ПАРОЛЬ"
//	КластерСерверов1С = "...";
//	ИмяБазыВКластере  = "...";
//	Пользователь      = "...";
//	Пароль            = "...";
//	СтрокаСоединения  = "Srvr=" + КластерСерверов1С + "Ref=" + ИмяБазыВКластере + ";Usr=" + Пользователь + ";Pwd=" + Пароль;
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// COM-СОЕДИНЕНИЕ

&НаСервере
Процедура COM_Запрос()
	
	// COM-подключение к базе #2
	СоединительCOM = Новый COMОбъект("v83.ComConnector");
	
	БазаCOM = СоединительCOM.Connect(СтрокаСоединения);
	
	//Запрос = Новый Запрос; // Запрос к базе #1
	Запрос = БазаCOM.NewObject("Запрос"); // Запрос к базе #2
	
	Запрос.Текст = "ВЫБРАТЬ
					|	СпрНоменклатура.Код КАК Код,
					|	СпрНоменклатура.Наименование КАК Наименование,
					|	СпрНоменклатура.Родитель.Наименование КАК Группа,
					|	СпрНоменклатура.ОсновнаяЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
					|	ЕСТЬNULL(ЦеныПродажи.Контрагент.Наименование, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
					|	ЕСТЬNULL(ЦеныПродажи.Цена, 0) КАК Цена
					|ИЗ
					|	Справочник.Номенклатура КАК СпрНоменклатура
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажи.СрезПоследних КАК ЦеныПродажи
					|		ПО (ЦеныПродажи.Номенклатура = СпрНоменклатура.Ссылка)
					|ГДЕ
					|	НЕ СпрНоменклатура.ЭтоГруппа

					|УПОРЯДОЧИТЬ ПО
					|	Код";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Сообщения.ДобавитьСтроку("Код товара: " + Выборка.Код + "
		|Наименование: " + Выборка.Наименование + " (" + Выборка.Группа + ")" + "
		|Покупатель: " + Выборка.Контрагент + "
		|Цена: " + Выборка.Цена + " руб./" + Выборка.ЕдиницаИзмерения +
		Символы.ПС);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура COM_Выгрузка()
	
	// COM-подключение к базе #2
	СоединительCOM = Новый COMОбъект("v83.ComConnector");
	БазаCOM = СоединительCOM.Connect(СтрокаСоединения);
	
	ГруппаВБазе2 = 
	БазаCOM.Справочники.Номенклатура.НайтиПоНаименованию("Номенклатура из базы #1", Истина);
	
	Если ГруппаВБазе2 = 
		БазаCOM.Справочники.Номенклатура.ПустаяСсылка() Тогда
		
		ГруппаВБазе2 = БазаCOM.Справочники.Номенклатура.СоздатьГруппу();
		ГруппаВБазе2.УстановитьНовыйКод();
		ГруппаВБазе2.Наименование = "Номенклатура из базы #1";
		ГруппаВБазе2.Записать();
	КонецЕсли;	
	
	// Выгружаем товары из группы "Для жилых помещений"
	ГруппаДляЖилыхПомещений =
	Справочники.Номенклатура.НайтиПоНаименованию("Для жилых помещений", Истина);
	
	Выборка = 
	Справочники.Номенклатура.Выбрать(ГруппаДляЖилыхПомещений);
	
	Пока Выборка.Следующий() Цикл
		
		КодТовараВБазе2 = "#1-" + Выборка.Код;
		
		ТоварВБазе2 =
		БазаCOM.Справочники.Номенклатура.НайтиПоКоду(КодТовараВБазе2);
		
		Если ТоварВБазе2 = 
			БазаCOM.Справочники.Номенклатура.ПустаяСсылка() Тогда
			
			ТоварВБазе2 = 
			БазаCOM.Справочники.Номенклатура.СоздатьЭлемент();
			
			ТоварВБазе2.Родитель = ГруппаВБазе2.Ссылка;
			ТоварВБазе2.Код = КодТовараВБазе2;
			ТоварВБазе2.Наименование = Выборка.Наименование;
			ТоварВБазе2.ОсновнаяЕдиницаИзмерения = 
				БазаCOM.Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(Выборка.Единица.Наименование);
				
			ТоварВБазе2.Записать();
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Сообщения.ДобавитьСтроку("Выгрузка элементов из группы ""Для жилых помещений"" успешно завершена!");
	
КонецПроцедуры

&НаСервере
Процедура COM_ИнтерактивныеОперации()
	
	// COM-подключение к базе #2
	СоединительCOM = Новый COMОбъект("v83.ComConnector");
	БазаCOM = СоединительCOM.Connect(СтрокаСоединения);
	
	БазаCOM.Отчеты.ПрайсЛист.ПолучитьФорму().Открыть();  // не отработает так как COM работает только с данными, интерфейс не доступен
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// OLE-СОЕДИНЕНИЕ

&НаСервере
Процедура OLE_Запрос()
	
	// OLE-подключение к базе #2
	БазаOLE = Новый COMОбъект("v83.Application"); // Толстяк
	БазаOLE.Connect(СтрокаСоединения);
	
	Запрос = БазаOLE.NewObject("Запрос"); // Запрос к базе #2
	
	Запрос.Текст = "ВЫБРАТЬ
					|	СпрНоменклатура.Код КАК Код,
					|	СпрНоменклатура.Наименование КАК Наименование,
					|	СпрНоменклатура.Родитель.Наименование КАК Группа,
					|	СпрНоменклатура.ОсновнаяЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
					|	ЕСТЬNULL(ЦеныПродажи.Контрагент.Наименование, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
					|	ЕСТЬNULL(ЦеныПродажи.Цена, 0) КАК Цена
					|ИЗ
					|	Справочник.Номенклатура КАК СпрНоменклатура
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажи.СрезПоследних КАК ЦеныПродажи
					|		ПО (ЦеныПродажи.Номенклатура = СпрНоменклатура.Ссылка)
					|ГДЕ
					|	НЕ СпрНоменклатура.ЭтоГруппа

					|УПОРЯДОЧИТЬ ПО
					|	Код";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Сообщения.ДобавитьСтроку("Код товара: " + Выборка.Код + "
		|Наименование: " + Выборка.Наименование + " (" + Выборка.Группа + ")" + "
		|Покупатель: " + Выборка.Контрагент + "
		|Цена: " + Выборка.Цена + " руб./" + Выборка.ЕдиницаИзмерения +
		Символы.ПС);
		
	КонецЦикла;
	
	// Закрываем запущенное приложение
	БазаOLE.ЗавершитьРаботуСистемы();
	
КонецПроцедуры

&НаСервере
Процедура OLE_Выгрузка()
	
	БазаOLE = Новый COMОбъект("v83.Application"); // Толстяк
	
	БазаOLE.Connect(СтрокаСоединения);
	
	// Создаем группу в базе #2
	ГруппаВБазе2 = 
	БазаOLE.Справочники.Номенклатура.НайтиПоНаименованию("Номенклатура из базы #1", Истина);
	
	Если ГруппаВБазе2 = БазаOLE.Справочники.Номенклатура.ПустаяСсылка() Тогда
		
		ГруппаВБазе2 = БазаOLE.Справочники.Номенклатура.СоздатьГруппу();
		ГруппаВБазе2.УстановитьНовыйКод();
		ГруппаВБазе2.Наименование = "Номенклатура из базы #1";
		ГруппаВБазе2.Записать();
		
	КонецЕсли;	
	
	// Выгружаем товары из группы "Для ванной"
	ГруппаДляВанной =
	Справочники.Номенклатура.НайтиПоНаименованию("Для ванной", Истина);
	
	Выборка = 
	Справочники.Номенклатура.Выбрать(ГруппаДляВанной);
	
	Пока Выборка.Следующий() Цикл
		
		КодТовараВБазе2 = "#1-" + Выборка.Код;
		
		ТоварВБазе2 = 
		БазаOLE.Справочники.Номенклатура.НайтиПоКоду(КодТовараВБазе2);
		
		Если ТоварВБазе2 =
			БазаOLE.Справочники.Номенклатура.ПустаяСсылка() Тогда
			
			ТоварВБазе2 = 
			БазаOLE.Справочники.Номенклатура.СоздатьЭлемент();
			
			ТоварВБазе2.Родитель = ГруппаВБазе2.Ссылка;
			ТоварВБазе2.Код = КодТовараВБазе2;
			ТоварВБазе2.Наименование = Выборка.Наименование;
			ТоварВБазе2.ОсновнаяЕдиницаИзмерения =
			БазаOLE.Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(Выборка.Единица.Наименование);
			
			ТоварВБазе2.Записать();
			
		КонецЕсли;	
		
	КонецЦикла;
	
	БазаOLE.ЗавершитьРаботуСистемы();
	
	Сообщения.ДобавитьСтроку("Выгрузка элементов из группы ""Для ванной"" успешно завершена!");	
	
КонецПроцедуры

&НаСервере
Процедура OLE_ИнтерактивныеОперации()
	
	БазаOLE = Новый COMОбъект("v83.Application"); // Толстяк
	БазаOLE.Connect(СтрокаСоединения);
	
	// Открываем форму отчета Прайс-лист в базе #2
	ПараметрыФормы = БазаOLE.NewObject("Структура");
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ФормаОтчетаВБазе2 = БазаOLE.ОткрытьФорму("Отчет.ПрайсЛист.Форма", ПараметрыФормы);
	
	// Сохраняем результат отчета
	ПолноеИмяФайла = ТекущийКаталог + "Прайс-лист из базы #2.htm";
	ФормаОтчетаВБазе2.Результат.Записать(ПолноеИмяФайла, БазаOLE.ТипФайлаТабличногоДокумента.HTML);
	
	БазаOLE.ЗавершитьРаботуСистемы();
	
	Сообщения.ДобавитьСтроку("Прайс-лист (из базы #2) успешно сформирован и сохранен!
	|" + ПолноеИмяФайла);	
	
КонецПроцедуры


#Область ПРОЧЕЕ

&НаКлиенте
Процедура ТекущийКаталогНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ТекущийКаталог);
	
КонецПроцедуры


&НаКлиенте
Процедура Команда_COM_Запрос(Команда)
	
	Сообщения.Очистить();
	COM_Запрос();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_COM_Выгрузка(Команда)
	
	Сообщения.Очистить();
	COM_Выгрузка();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_COM_ИнтерактивныеОперации(Команда)
	
	Сообщения.Очистить();
	COM_ИнтерактивныеОперации();
	
КонецПроцедуры


&НаКлиенте
Процедура Команда_OLE_Запрос(Команда)
	
	Сообщения.Очистить();
	OLE_Запрос();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_OLE_Выгрузка(Команда)
	
	Сообщения.Очистить();
	OLE_Выгрузка();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_OLE_ИнтерактивныеОперации(Команда)
	
	Сообщения.Очистить();
	OLE_ИнтерактивныеОперации();
	
КонецПроцедуры

#КонецОбласти
