
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийКаталог = 
	ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("ОсновнойКаталог") + "Вебинар 3\Подключение к другой 1С-базе\";

	
	///////////////////////////////////////////////////
	// СТРОКА СОЕДИНЕНИЯ (одинакова для COM и OLE):
	
	// - Для файлового варианта: "File=КАТАЛОГ;Usr=ПОЛЬЗОВАТЕЛЬ;Pwd=ПАРОЛЬ"
	КаталогБазы       = ТекущийКаталог + "База для подключения";
	Пользователь      = "";
	Пароль            = "";
	СтрокаСоединения  = "File=""" + КаталогБазы + """;Usr=" + Пользователь + ";Pwd=" + Пароль;
	
//	// - Для клиент-серверного варианта: "Srvr=КЛАСТЕР;Ref=БАЗА;Usr=ПОЛЬЗОВАТЕЛЬ;Pwd=ПАРОЛЬ"
//	КластерСерверов1С = "...";
//	ИмяБазыВКластере  = "...";
//	Пользователь      = "...";
//	Пароль            = "...";
//	СтрокаСоединения  = "Srvr=" + КластерСерверов1С + "Ref=" + ИмяБазыВКластере + ";Usr=" + Пользователь + ";Pwd=" + Пароль;
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// COM-СОЕДИНЕНИЕ

&НаСервере
Процедура COM_Запрос()
	
	
	
КонецПроцедуры

&НаСервере
Процедура COM_Выгрузка()
	
	
	
КонецПроцедуры

&НаСервере
Процедура COM_ИнтерактивныеОперации()
	
	
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// OLE-СОЕДИНЕНИЕ

&НаСервере
Процедура OLE_Запрос()
	
	
	
КонецПроцедуры

&НаСервере
Процедура OLE_Выгрузка()
	
	
	
КонецПроцедуры

&НаСервере
Процедура OLE_ИнтерактивныеОперации()
	
	
	
КонецПроцедуры



#Область ПРОЧЕЕ

&НаКлиенте
Процедура ТекущийКаталогНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ТекущийКаталог);
	
КонецПроцедуры


&НаКлиенте
Процедура Команда_COM_Запрос(Команда)
	
	Сообщения.Очистить();
	COM_Запрос();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_COM_Выгрузка(Команда)
	
	Сообщения.Очистить();
	COM_Выгрузка();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_COM_ИнтерактивныеОперации(Команда)
	
	Сообщения.Очистить();
	COM_ИнтерактивныеОперации();
	
КонецПроцедуры


&НаКлиенте
Процедура Команда_OLE_Запрос(Команда)
	
	Сообщения.Очистить();
	OLE_Запрос();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_OLE_Выгрузка(Команда)
	
	Сообщения.Очистить();
	OLE_Выгрузка();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_OLE_ИнтерактивныеОперации(Команда)
	
	Сообщения.Очистить();
	OLE_ИнтерактивныеОперации();
	
КонецПроцедуры

#КонецОбласти
