
Функция PingGET(Запрос)  
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	Результат = Новый Структура("result", "ok");
	ЗаписатьJSON(ЗаписьJSON, Результат);
	ТелоОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ; 
	
КонецФункции

Функция GoodsGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200); 
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	
	ДатаОстатков = ТекущаяДатаСеанса();
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ТаблицаОстатков = Обмен.ОстаткиТоваров(ДатаОстатков); 
	
	ЗаписатьJSON(ЗаписьJSON, ОбщегоНазначения_Сервер.ТаблицаЗначенийВМассив(ТаблицаОстатков));

	ТелоОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);

	Возврат Ответ;
	
КонецФункции
