
////////////////////////////////////////////////////////////////////////////////
// ИЗВЛЕЧЕНИЕ ДАННЫХ ИЗ HTML-ДОКУМЕНТА

&НаКлиенте
Процедура Извлечь_КодHTML(Команда)
	
	Документ = Элементы.ДокументHTML.Документ;
	
	КодHTML = Документ.DocumentElement.outerHTML;
	
	ОбщегоНазначения_Клиент.ПоказатьТекстВНовомОкне(КодHTML, "HTML-код");	
	
КонецПроцедуры

&НаКлиенте
Процедура Извлечь_Текст(Команда)
	
	Документ = Элементы.ДокументHTML.Документ;
	
	ВидимыйТекст = Документ.DocumentElement.innerText;
	
	ОбщегоНазначения_Клиент.ПоказатьТекстВНовомОкне(ВидимыйТекст, "Текст");		
	
КонецПроцедуры

&НаКлиенте
Процедура Извлечь_Гиперссылки(Команда)
	
	Документ = Элементы.ДокументHTML.Документ;
	ТекстСообщения = "";
	
	ВсеГиперссылкиHTML = Документ.Links;
	
	Для Каждого ГиперссылкаHTML Из ВсеГиперссылкиHTML Цикл
		
		Адрес = ГиперссылкаHTML.HRef;
		ВидимыйТекст = ГиперссылкаHTML.InnerText;
		
		ТекстСообщения = ТекстСообщения +
		"Адрес: " + Адрес + "
		|Текст: " + ВидимыйТекст + Символы.ПС;
		
	КонецЦикла;
	
	КоличествоГиперссылок = ВсеГиперссылкиHTML.Length;
	
	ТекстСообщения = ТекстСообщения + 
	"--------------------------------------
	|Всего гиперссылок: " + КоличествоГиперссылок;
	
	ОбщегоНазначения_Клиент.ПоказатьТекстВНовомОкне(ТекстСообщения, "Гиперссылки");		
	
КонецПроцедуры

&НаКлиенте
Процедура Извлечь_Картинки(Команда)
	
	
	
КонецПроцедуры


#Область ПРОЧЕЕ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийКаталог = 
	ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("ОсновнойКаталог") + "Вебинар 2\Обмен через html-документы\";
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДокументаHTMLНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбора = 
	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбора.Фильтр = "HTML-документ (*.htm;*.html)|*.htm;*.html";
	
	Если ПустаяСтрока(АдресДокументаHTML) Тогда
		ДиалогВыбора.Каталог = ТекущийКаталог; // Каталог по умолчанию
	КонецЕсли;
	
	Если ДиалогВыбора.Выбрать() Тогда
		АдресДокументаHTML = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрДокумента(Команда)
	
	ДокументHTML = АдресДокументаHTML;
	
КонецПроцедуры

#КонецОбласти
