
////////////////////////////////////////////////////////////////////////////////
// ОБЪЕКТ "XBASE"

&НаСервере
Процедура Выгрузить()
	
	ОбъектXBase = Новый XBase;
	ОбъектXBase.Кодировка = КодировкаXBase.ANSI; // Windows
	
	// Описание структуры таблицы
	ОбъектXBase.поля.Добавить("NUMBER", "S", 4); // Строка
	ОбъектXBase.поля.Добавить("DATE", "D"); // Дата
	ОбъектXBase.поля.Добавить("CUSTOMER", "S", 25); // Строка
	ОбъектXBase.поля.Добавить("PERSON", "S", 50); // Строка
	ОбъектXBase.поля.Добавить("TOTALSUM", "N", 15, 2); // Число
	ОбъектXBase.поля.Добавить("DELETEMARK", "L"); // Булево
	
	// Создание файла
	ОбъектXBase.СоздатьФайл(ТекущийКаталог + "Orders.dbf");
	
	Выборка = Документы.ЗаказПокупателя.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбъектXBase.Добавить(); // Строку
		
		ОбъектXBase.NUMBER = Выборка.Номер;
		ОбъектXBase.DATE = Выборка.Дата;
		ОбъектXBase.CUSTOMER = Выборка.Покупатель;
		ОбъектXBase.PERSON = Выборка.КонтактноеЛицо;
		ОбъектXBase.TOTALSUM = Выборка.СуммаПоДокументу;
		ОбъектXBase.DELETEMARK = Выборка.ПометкаУдаления;
		
		ОбъектXBase.Записать();
		
	КонецЦикла;	
	
	ОбъектXBase.ЗакрытьФайл();
	
	Сообщения.ДобавитьСтроку("Выгрузка данных завершена, перейдите в текущий каталог!");		
	
КонецПроцедуры

&НаСервере
Процедура Прочитать()
	
	ОбъектXBase = Новый XBase(ТекущийКаталог + "Orders.dbf");
	ОбъектXBase.Кодировка = КодировкаXBase.ANSI; // Windows
	
	// Данные 1-й строки
	СтрокаXBase(ОбъектXBase);
	
	// Начиная со 2-й строки
	Пока ОбъектXBase.Следующая() Цикл
		
		// Данные очередной строки
		СтрокаXBase(ОбъектXBase);
		
	КонецЦикла;	
	
	ОбъектXBase.ЗакрытьФайл();
	
КонецПроцедуры

&НаСервере
Процедура СтрокаXBase(ОбъектXBase)
	
	Номер = ОбъектXBase.NUMBER;
	Дата = ОбъектXBase.DATE;
	Покупатель = ОбъектXBase.CUSTOMER;
	КонтактноеЛицо = ОбъектXBase.PERSON;
	СуммаПоДокументу = ОбъектXBase.TOTALSUM;
	ПометкаУдаления = ОбъектXBase.DELETEMARK;
	
	Сообщения.ДобавитьСтроку("Номер: " + Номер + "
	|Дата: " + Дата + "
	|Покупатель: " + Покупатель + "
	|Контактное лицо: " + КонтактноеЛицо + "
	|Сумма по документу: " + СуммаПоДокументу + "
	|Пометка удаления: " + Булево(ПометкаУдаления) + Символы.ПС);
	
КонецПроцедуры	

&НаСервере
Процедура Удалить()
	
	ОбъектXBase = Новый XBase(ТекущийКаталог + "Orders.dbf");
	ОбъектXBase.Кодировка = КодировкаXBase.ANSI; // Windows
	
	ОбъектXBase.Первая();
	
	Пока НЕ ОбъектXBase.ВКонце() Цикл
		
		// Данные очередной строки
		Если ОбъектXBase.TOTALSUM < 15000 Тогда
			ОбъектXBase.Удалить();
		КонецЕсли;	
		ОбъектXBase.Следующая();
		
	КонецЦикла;	
	
	ОбъектXBase.ЗакрытьФайл();
	
	Сообщения.ДобавитьСтроку("Удаление данных завершено, перейдите в текущий каталог!");			
	
КонецПроцедуры



#Область ПРОЧЕЕ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийКаталог = 
	ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("ОсновнойКаталог") + "Вебинар 1\Обмен через dbf-файлы\";
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийКаталогНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ТекущийКаталог);
	
КонецПроцедуры


&НаКлиенте
Процедура Команда_Выгрузить(Команда)
	
	Сообщения.Очистить();
	Выгрузить();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_Прочитать(Команда)
	
	Сообщения.Очистить();
	Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_УдалитьМеньше15000(Команда)
	
	Сообщения.Очистить();
	Удалить();
	
КонецПроцедуры

#КонецОбласти
