
////////////////////////////////////////////////////////////////////////////////
// АРХИВ ZIP

&НаСервере
Процедура Упаковать()
	
	Сейчас = ТекущаяДата();

	// Создаём объект записи ZIP-архива
	ИмяАрхивногоФайла = ТекущийКаталог + "Архив html-документа.zip";
	Комментарий = "в архиве содержится html-документ с информацией о компании 'Инфостарт'";
	ЗаписьZIP = Новый ЗаписьZipФайла(ИмяАрхивногоФайла, , Комментарий);

	// Добавляем необходимые файлы в архив
	ОсновнойКаталог = ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("ОсновнойКаталог");
	ЗаписьZIP.Добавить(ОсновнойКаталог + "Вебинар 1\Обмен через html-документы\Пример HTML-документа\infostart.htm", РежимСохраненияПутейZIP.НеСохранятьПути);
	ЗаписьZIP.Добавить(ОсновнойКаталог + "Вебинар 1\Обмен через html-документы\Пример HTML-документа\infostartru.png", РежимСохраненияПутейZIP.НеСохранятьПути);
	ЗаписьZIP.Добавить(ОсновнойКаталог + "Вебинар 1\Обмен через html-документы\Пример HTML-документа\logo.jpg", РежимСохраненияПутейZIP.НеСохранятьПути);

	// Записываем архив на диск
	ЗаписьZIP.Записать();

	// Время, которое потребовалось для упаковки файлов
	Сообщения.ДобавитьСтроку("Упаковка заняла " + (ТекущаяДата() - Сейчас) + " секунд(ы)");		
	
КонецПроцедуры

&НаСервере
Процедура Распаковать()
	
	Сейчас = ТекущаяДата();

	// Открываем файл для чтения
	ИмяАрхивногоФайла = ТекущийКаталог + "Архив html-документа.zip";
	ЧтениеZIP = Новый ЧтениеZipФайла(ИмяАрхивногоФайла);

	// Комментарий архива
	Сообщения.ДобавитьСтроку("Комментарий: " + ЧтениеZIP.Комментарий);

	// Достаем все файлы из архива
	ЧтениеZIP.ИзвлечьВсе(ТекущийКаталог, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
	ЧтениеZIP.Закрыть();

	// Время, которое потребовалось для распаковки файлов
	Сообщения.ДобавитьСтроку("Распаковка заняла " + (ТекущаяДата() - Сейчас) + " секунд(ы)");	
	
КонецПроцедуры



#Область ПРОЧЕЕ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийКаталог = 
	ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("ОсновнойКаталог") + "Вебинар 1\Обмен через zip-файлы\";
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийКаталогНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ТекущийКаталог);
	
КонецПроцедуры


&НаКлиенте
Процедура Команда_Упаковать(Команда)
	
	Сообщения.Очистить();
	Упаковать();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_Распаковать(Команда)
	
	Сообщения.Очистить();
	Распаковать();
	
КонецПроцедуры

#КонецОбласти
