
&НаКлиенте
Перем СоединениеFTP;

&НаКлиенте
Процедура УстановитьСоединение(Команда)
	
	// Настройки вашей учетной записи:
	//АдресFTPСервера = "ftp.intel.com"; // Без начального "ftp://"!
	//ИмяПользователя = "";
	//Пароль          = "";
	
	АдресFTPСервера = "79.175.45.138"; // Без начального "ftp://"!
	ИмяПользователя = "ftp1c_adm";
	Пароль          = "o!pL2O";	
	
	Попытка
		
		// Попытка установить соединения:
		СоединениеFTP = Новый FTPСоединение(АдресFTPСервера, 21, ИмяПользователя, Пароль, , Истина);
		
		// Получилось!
		Сообщения.ДобавитьСтроку("Соединение с сервером """ + АдресFTPСервера + """ успешно установлено!");
		
		
	Исключение
		
    	Сообщения.ДобавитьСтроку(ОписаниеОшибки());
    	Сообщения.ДобавитьСтроку("Не удалось установить соединение с сервером  """ + АдресFTPСервера + """ !");
		
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьФайл(Команда)
	
	// Считаем, что к этому моменту уже установлено соединение (см. выше)
	
	ПолноеИмяЛокальногоФайла = ТекущийКаталог + "Orders.DBF";
	ПолноеИмяФайлаНаСервере  = "/ftp1c/test/OrdersObmen8BondarenkoNN.DBF";
	
	Попытка
		
		СоединениеFTP.Записать(ПолноеИмяЛокальногоФайла, ПолноеИмяФайлаНаСервере);
		Сообщения.ДобавитьСтроку("Файл успешно отправлен на сервер:
								  |" + СоединениеFTP.Сервер + ПолноеИмяФайлаНаСервере);
		
	Исключение
		
    	Сообщения.ДобавитьСтроку(ОписаниеОшибки());
    	Сообщения.ДобавитьСтроку("Не удалось загрузить файл на сервер!");
		
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьФайл(Команда)
	
	// Считаем, что к этому моменту уже установлено соединение (см. выше)
	
	ПолноеИмяФайлаНаСервере  = "/ftp1c/test/Retivy.DBF";
	ПолноеИмяЛокальногоФайла = ТекущийКаталог + "Привет.DBF";
	
	Попытка
		
		СоединениеFTP.Получить(ПолноеИмяФайлаНаСервере, ПолноеИмяЛокальногоФайла);
		Сообщения.ДобавитьСтроку("Файл успешно загружен с сервера и находится здесь:
								|" + ПолноеИмяЛокальногоФайла);
		
	Исключение
		
    	Сообщения.ДобавитьСтроку(ОписаниеОшибки());
    	Сообщения.ДобавитьСтроку("Не удалось скачать файл с сервера!");
		
	КонецПопытки;	
	
КонецПроцедуры



#Область ПРОЧЕЕ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийКаталог = 
	ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("ОсновнойКаталог") + "Вебинар 2\Передача файлов по ftp-протоколу\";
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийКаталогНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ТекущийКаталог);
	
КонецПроцедуры

#КонецОбласти
