&НаСервере
Функция ПолучитьКурсыВалютСервер(НомерПопытки)
	
	Попытка
		ПодключениеКСервису = WSСсылки.WSЦентроБанк.СоздатьWSПрокси("http://web.cbr.ru/", "DailyInfo", "DailyInfoSoap");

		ТипПараметра = ПодключениеКСервису.ФабрикаXDTO.Тип("http://web.cbr.ru/", "GetCursOnDate");
		ПараметрXDTO = ПодключениеКСервису.ФабрикаXDTO.Создать(ТипПараметра);
		ПараметрXDTO.On_date = НужнаяДата;

		РезультатXDTO = ПодключениеКСервису.GetCursOnDateXML(ПараметрXDTO);
			
		СписокКурсовXDTO = РезультатXDTO.GetCursOnDateXMLResult.ValuteData.ValuteCursOnDate;
		
		Сообщения.Очистить();
		Сообщения.ДобавитьСтроку(ВРег("Курсы валют на " + Формат(НужнаяДата, "ДЛФ=DD")) + ":" + Символы.ПС);	
		
		Для Каждого КурсXDTO Из СписокКурсовXDTO Цикл
			Код = КурсXDTO.VchCode;
			Наименование = КурсXDTO.Vname;
			Курс = КурсXDTO.Vcurs;
			
			Сообщения.ДобавитьСтроку("1 " + Код + ": " + Курс + " руб. (" + СокрЛП(Наименование) + ")");
		КонецЦикла;
		
		Возврат Истина; // Успешное получение данных
		
	Исключение
		Сообщения.Очистить();
		Сообщения.ДобавитьСтроку("Попытка №" + НомерПопытки + " не удалась.");
		Сообщения.ДобавитьСтроку("Подробности: " + ОписаниеОшибки());
		Возврат Ложь; // Ошибка при вызове
		
	КонецПопытки;
	
КонецФункции

#Область ПРОЧЕЕ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийКаталог = 
		ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("ОсновнойКаталог") + "Вебинар 6\Сторонний web-сервис\";
	
	НужнаяДата = ТекущаяДата();
	ДатаНачала = НачалоМесяца(ТекущаяДата());
	ДатаОкончания = КонецМесяца(ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийКаталогНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ТекущийКаталог);
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_ВызватьОперацию_GetCursOnDate(Команда)
	
	Сообщения.Очистить();
	
	Если НЕ ЗначениеЗаполнено(НужнаяДата) Тогда
		НужнаяДата = ТекущаяДата();
	КонецЕсли;
	
	МаксПопыток = 3;
	ИнтервалСек = 5;
	
	НомерПопытки = 0;
	
	Пока НомерПопытки <> МаксПопыток Цикл
				
		Если ПолучитьКурсыВалютСервер(НомерПопытки) Тогда
			Возврат;
		КонецЕсли;
		
		Если НомерПопытки < МаксПопыток Тогда
			Сообщения.ДобавитьСтроку("Сервер ЦБ РФ недоступен. Следующая попытка через " + ИнтервалСек + " секунд...");
			
			ВремяОкончания = ТекущаяДата() + ИнтервалСек;
			
			Пока ТекущаяДата() < ВремяОкончания Цикл
				ОбработкаПрерыванияПользователя(); 
			КонецЦикла;
		КонецЕсли;
		
		НомерПопытки = НомерПопытки + 1;
		
	КонецЦикла;
	
	// Если цикл завершился, а возврата не было, значит все попытки исчерпаны
	Сообщения.ДобавитьСтроку("Не удалось получить курсы валют после " + МаксПопыток + " попыток.");
	
КонецПроцедуры

#КонецОбласти