
////////////////////////////////////////////////////////////////////////////////
// С ПРЕДВАРИТЕЛЬНЫМ СОЗДАНИЕМ XDTO-ПАКЕТОВ

&НаСервере
Процедура ОдинТовар_Выгрузить()
	
	// Создание файла
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ТекущийКаталог + "Один товар.xml");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	// Типы данных для выгрузки
	ОписаниеТипаТовар = 
	ФабрикаXDTO.Тип("http://infostart.ru/price", "Товар");
	
	// Данные
	ТоварXDTO = ФабрикаXDTO.Создать(ОписаниеТипаТовар);
	
	ТоварXDTO.Код = 10;
	ТоварXDTO.Наименование = "Ванна чугунная";
	ТоварXDTO.Цена = 15000;
	
	// Запись в файл
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ТоварXDTO);
	
	ЗаписьXML.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ОдинТовар_Прочитать()
	
	// Открываем файл на чтение
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ТекущийКаталог + "Один товар.xml");
	
	// Типы данных для выгрузки
	ОписаниеТипаТовар = 
	ФабрикаXDTO.Тип("http://infostart.ru/price", "Товар");
	
	// Данные
	ТоварXDTO = 
	ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ОписаниеТипаТовар);
	
	Код = ТоварXDTO.Код;
	Наименование = ТоварXDTO.Наименование;
	Цена = ТоварXDTO.Цена;
	
	Сообщения.ДобавитьСтроку("Код: " + Код + "
	|Наименование: " + Наименование + "
	|Цена: " + Цена);
	
	ЧтениеXML.Закрыть();
	
КонецПроцедуры


&НаСервере
Процедура СписокТоваров_Выгрузить()
	
	// Создание файла
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ТекущийКаталог + "Список товаров.xml");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	// Типы данных для выгрузки
	ОписаниеТипаТовар = 
	ФабрикаXDTO.Тип("http://infostart.ru/price", "Товар");
	
	ОписаниеТипаПрайсЛист = 
	ФабрикаXDTO.Тип("http://infostart.ru/price", "ПрайсЛист");

	// Корневой элемент
	ПрайсЛистXDTO = ФабрикаXDTO.Создать(ОписаниеТипаПрайсЛист);
	
	ПрайсЛистXDTO.Организация =
	ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("НаименованиеФирмы");
	
	ПрайсЛистXDTO.ДатаАктуальности = ТекущаяДата();
	
	// Товар #1
	ТоварXDTO = ФабрикаXDTO.Создать(ОписаниеТипаТовар);
	
	ТоварXDTO.Код = 10;
	ТоварXDTO.Наименование = "Ванна чугунная";
	ТоварXDTO.Цена = 15000;
	
	ПрайсЛистXDTO.Товары.Добавить(ТоварXDTO);
	
	// Товар #2
	ТоварXDTO = ФабрикаXDTO.Создать(ОписаниеТипаТовар);
	
	ТоварXDTO.Код = 11;
	ТоварXDTO.Наименование = "Клей для плитки";
	ТоварXDTO.Цена = 350;
	
	ПрайсЛистXDTO.Товары.Добавить(ТоварXDTO);
	
	// Запись в файл
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ПрайсЛистXDTO);
	
	ЗаписьXML.Закрыть();	
	
КонецПроцедуры

&НаСервере
Процедура СписокТоваров_Прочитать()
	
	// Открываем файл на чтение
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ТекущийКаталог + "Список товаров.xml");
	
	// Типы данных для выгрузки
	ОписаниеТипаПрайсЛист = 
	ФабрикаXDTO.Тип("http://infostart.ru/price", "ПрайсЛист");
	
	ПрайсЛистXDTO = 
	ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ОписаниеТипаПрайсЛист);
	
	Организация = ПрайсЛистXDTO.Организация;
	ДатаАктуальности = ПрайсЛистXDTO.ДатаАктуальности;
	
	Сообщения.ДобавитьСтроку("ПРАЙС-ЛИСТ от " + Организация +
	" (актуален на " + ДатаАктуальности + "):
	|----------------------------------------------------------------");
	
	// Товар #1
	ТоварXDTO = ПрайсЛистXDTO.Товары[0];
	
	Сообщения.ДобавитьСтроку("Код: " + ТоварXDTO.Код + "
	|Наименование: " + ТоварXDTO.Наименование + "
	|Цена: " + ТоварXDTO.Цена + Символы.ПС);
	
	// Товар #2
	ТоварXDTO = ПрайсЛистXDTO.Товары[1];
	
	Сообщения.ДобавитьСтроку("Код: " + ТоварXDTO.Код + "
	|Наименование: " + ТоварXDTO.Наименование + "
	|Цена: " + ТоварXDTO.Цена + Символы.ПС);
	
	ЧтениеXML.Закрыть();
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// БЕЗ ИЗМЕНЕНИЯ КОНФИГУРАЦИИ

&НаКлиенте
Процедура БезИзмененияКонфигурации_СписокТоваров_Выгрузить()
	
	// Для работы с XDTO-типами из КОНФИГУРАЦИИ используем стандартный объект "ФабрикаXDTO".
	// Для работы с XDTO-типами из ВНЕШНЕЙ XSD-СХЕМЫ нужно сначала создать свою фабрику!
	
	// Создаём фабрику на основе внешней xsd-схемы:
	ПолноеИмяФайлаСхемы = ТекущийКаталог + "Прайс-лист (xml-схема).xsd";
	МояФабрикаXDTO = СоздатьФабрикуXDTO(ПолноеИмяФайлаСхемы);
	
	// Дальше всё как обычно, только через "МояФабрикаXDTO":
	
	// Создание файла
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ТекущийКаталог + "Список товаров (без изменения конфигурации).xml");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	// Типы данных для выгрузки
	ОписаниеТипаТовар = 
	МояФабрикаXDTO.Тип("http://infostart.ru/price", "Товар");
	
	ОписаниеТипаПрайсЛист = 
	МояФабрикаXDTO.Тип("http://infostart.ru/price", "ПрайсЛист");

	// Корневой элемент
	ПрайсЛистXDTO = МояФабрикаXDTO.Создать(ОписаниеТипаПрайсЛист);
	
	ПрайсЛистXDTO.Организация =
	ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("НаименованиеФирмы");
	
	ПрайсЛистXDTO.ДатаАктуальности = ТекущаяДата();
	
	// Товар #1
	ТоварXDTO = МояФабрикаXDTO.Создать(ОписаниеТипаТовар);
	
	ТоварXDTO.Код = 10;
	ТоварXDTO.Наименование = "Ванна чугунная";
	ТоварXDTO.Цена = 15000;
	
	ПрайсЛистXDTO.Товары.Добавить(ТоварXDTO);
	
	// Товар #2
	ТоварXDTO = МояФабрикаXDTO.Создать(ОписаниеТипаТовар);
	
	ТоварXDTO.Код = 11;
	ТоварXDTO.Наименование = "Клей для плитки";
	ТоварXDTO.Цена = 350;
	
	ПрайсЛистXDTO.Товары.Добавить(ТоварXDTO);
	
	// Запись в файл
	МояФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ПрайсЛистXDTO);
	
	ЗаписьXML.Закрыть();	
		
КонецПроцедуры

&НаКлиенте
Процедура БезИзмененияКонфигурации_СписокТоваров_Прочитать()
	
	// Для работы с XDTO-типами из КОНФИГУРАЦИИ используем стандартный объект "ФабрикаXDTO".
	// Для работы с XDTO-типами из ВНЕШНЕЙ XSD-СХЕМЫ нужно сначала создать свою фабрику!
	
	// Создаём фабрику на основе внешней xsd-схемы:
	ПолноеИмяФайлаСхемы = ТекущийКаталог + "Прайс-лист (xml-схема).xsd";
	МояФабрикаXDTO = СоздатьФабрикуXDTO(ПолноеИмяФайлаСхемы);
	
	// Дальше всё как обычно, только через "МояФабрикаXDTO":
	
	// Открываем файл на чтение
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ТекущийКаталог + "Список товаров (без изменения конфигурации).xml");
	
	// Типы данных для выгрузки
	ОписаниеТипаПрайсЛист = 
	МояФабрикаXDTO.Тип("http://infostart.ru/price", "ПрайсЛист");
	
	ПрайсЛистXDTO = 
	МояФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ОписаниеТипаПрайсЛист);
	
	Организация = ПрайсЛистXDTO.Организация;
	ДатаАктуальности = ПрайсЛистXDTO.ДатаАктуальности;
	
	Сообщения.ДобавитьСтроку("ПРАЙС-ЛИСТ от " + Организация +
	" (актуален на " + ДатаАктуальности + "):
	|----------------------------------------------------------------");
	
	// Товар #1
	ТоварXDTO = ПрайсЛистXDTO.Товары[0];
	
	Сообщения.ДобавитьСтроку("Код: " + ТоварXDTO.Код + "
	|Наименование: " + ТоварXDTO.Наименование + "
	|Цена: " + ТоварXDTO.Цена + Символы.ПС);
	
	// Товар #2
	ТоварXDTO = ПрайсЛистXDTO.Товары[1];
	
	Сообщения.ДобавитьСтроку("Код: " + ТоварXDTO.Код + "
	|Наименование: " + ТоварXDTO.Наименование + "
	|Цена: " + ТоварXDTO.Цена + Символы.ПС);
	
	ЧтениеXML.Закрыть();
	
КонецПроцедуры



#Область ПРОЧЕЕ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийКаталог = 
	ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("ОсновнойКаталог") + "Вебинар 5\Механизм xdto\";
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийКаталогНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ТекущийКаталог);
	
КонецПроцедуры


&НаКлиенте
Процедура Команда_ОдинТовар_Выгрузить(Команда)
	
	Сообщения.Очистить();
	
	ОдинТовар_Выгрузить();
	
	Сообщения.ДобавитьСтроку("Выгрузка завершена.");
	ВывестиТекстXMLФайлаВОкноСообщений(ТекущийКаталог + "Один товар.xml");
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_ОдинТовар_Прочитать(Команда)
	
	Сообщения.Очистить();
	ОдинТовар_Прочитать();
	
КонецПроцедуры


&НаКлиенте
Процедура Команда_СписокТоваров_Выгрузить(Команда)
	
	Сообщения.Очистить();
	
	СписокТоваров_Выгрузить();
	
	Сообщения.ДобавитьСтроку("Выгрузка завершена.");
	ВывестиТекстXMLФайлаВОкноСообщений(ТекущийКаталог + "Список товаров.xml");
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_СписокТоваров_Прочитать(Команда)
	
	Сообщения.Очистить();
	СписокТоваров_Прочитать();
	
КонецПроцедуры


&НаКлиенте
Процедура Команда_БезИзмененияКонфигурации_СписокТоваров_Выгрузить(Команда)
	
	Сообщения.Очистить();
	
	БезИзмененияКонфигурации_СписокТоваров_Выгрузить();
	
	Сообщения.ДобавитьСтроку("Выгрузка завершена.");
	ВывестиТекстXMLФайлаВОкноСообщений(ТекущийКаталог + "Список товаров (без изменения конфигурации).xml");
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_БезИзмененияКонфигурации_СписокТоваров_Прочитать(Команда)
	
	Сообщения.Очистить();
	БезИзмененияКонфигурации_СписокТоваров_Прочитать();
	
КонецПроцедуры


&НаКлиенте
Процедура ВывестиТекстXMLФайлаВОкноСообщений(ПолноеИмяФайла)
	
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ПолноеИмяФайла, "UTF-8");
	
	Сообщения.ДобавитьСтроку("ТЕКСТ ИЗ ФАЙЛА """ + ПолноеИмяФайла + """:
							 |--------------------------------------------------------------------------------
							 |
							 |" + ТекстДок.ПолучитьТекст());
	
КонецПроцедуры

#КонецОбласти
