
////////////////////////////////////////////////////////////////////////////////
// Вариант 1: ОБЪЕКТНЫЙ СПОСОБ

&НаСервере
Процедура ОбъектныйСпособ_Выгрузить()
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ТекущийКаталог + "Физическое лицо (способ 1).txt");

	Выборка = Справочники.ФизическиеЛица.Выбрать(Справочники.ФизическиеЛица.РАБОТАЮЩИЕ, , , "Наименование");
	// Сортировка по алфавиту
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураФЛ = Новый Структура;
		СтруктураФЛ.Вставить("ФИО", Выборка.Наименование);
		СтруктураФЛ.Вставить("Код", Выборка.Код);
		СтруктураФЛ.Вставить("ИНН", Выборка.ИНН);
		СтруктураФЛ.Вставить("ДатаРождения", Выборка.ДатаРождения);
		
		НастройкиСериализации = Новый НастройкиСериализацииJSON;     
		НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
		НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
		
		ЗаписатьJSON(ЗаписьJSON, СтруктураФЛ, НастройкиСериализации);
		Прервать;
			
	КонецЦикла;
	
	ЗаписьJSON.Закрыть();
	
	Сообщения.ДобавитьСтроку("Выгрузка данных завершена, перейдите в текущий каталог!");	
	
КонецПроцедуры

&НаСервере
Процедура ОбъектныйСпособ_Прочитать()
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьФайл(ТекущийКаталог + "Физическое лицо (способ 1).txt");
	ОбъектИзJSON = ПрочитатьJSON(ЧтениеJSON);
	
	ДатаРождения = ПрочитатьДатуJSON(ОбъектИзJSON.ДатаРождения, ФорматДатыJSON.ISO);
	
	Сообщения.ДобавитьСтроку("Фамилия, имя, отчество: " + ОбъектИзJSON.ФИО + "
	|Код: " + ОбъектИзJSON.Код + "
	|ИНН: " + ОбъектИзJSON.ИНН + "
	|Дата рождения: " + Формат(ДатаРождения, "ДФ=dd.MM.yyyy") + Символы.ПС);
		
	ЧтениеJSON.Закрыть();
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// Вариант 2: ПОТОКОВЫЙ СПОСОБ

&НаСервере
Процедура ПотоковыйСпособ_Выгрузить()
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ТекущийКаталог + "Физическое лицо (способ 2).txt");

	Выборка = Справочники.ФизическиеЛица.Выбрать(Справочники.ФизическиеЛица.РАБОТАЮЩИЕ, , , "Наименование");
	// Сортировка по алфавиту
	
	Пока Выборка.Следующий() Цикл
	
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("ФИО");
		ЗаписьJSON.ЗаписатьЗначение(Выборка.Наименование);
		
		ЗаписьJSON.ЗаписатьИмяСвойства("Код");
		ЗаписьJSON.ЗаписатьЗначение(Выборка.Код);
		
		ЗаписьJSON.ЗаписатьИмяСвойства("ИНН");
		ЗаписьJSON.ЗаписатьЗначение(Выборка.ИНН);
				
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		Прервать;
	
	КонецЦикла;
	
	ЗаписьJSON.Закрыть();
	
	Сообщения.ДобавитьСтроку("Выгрузка данных завершена, перейдите в текущий каталог!");		
	
КонецПроцедуры

&НаСервере
Процедура ПотоковыйСпособ_Прочитать()
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьФайл(ТекущийКаталог + "Физическое лицо (способ 2).txt");
	
	Пока ЧтениеJSON.Прочитать() Цикл
		
		ТипЗнчJSON = ЧтениеJSON.ТипТекущегоЗначения;
		
		Если ТипЗнчJSON = ТипЗначенияJSON.НачалоОбъекта Тогда
			// обрабатываем объект
		ИначеЕсли ТипЗнчJSON = ТипЗначенияJSON.ИмяСвойства
			ИЛИ ТипЗнчJSON = ТипЗначенияJSON.Строка 
			ИЛИ ТипЗнчJSON = ТипЗначенияJSON.Число 
			ИЛИ ТипЗнчJSON = ТипЗначенияJSON.Булево Тогда
			Значение = ЧтениеJSON.ТекущееЗначение;
			
			// ДОПИСАТЬ
			
		КонецЕсли;
		
	КонецЦикла;	
	
	// ДОПИСАТЬ
		
	ЧтениеJSON.Закрыть();
	
КонецПроцедуры



#Область ПРОЧЕЕ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийКаталог = 
	ОбщегоНазначения_Сервер.ПолучитьЗначениеКонстанты("ОсновнойКаталог") + "Вебинар 5\Работа с json\";
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийКаталогНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ТекущийКаталог);
	
КонецПроцедуры


&НаКлиенте
Процедура Команда_ОбъектныйСпособ_Выгрузить(Команда)
	
	Сообщения.Очистить();
	ОбъектныйСпособ_Выгрузить();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_ОбъектныйСпособ_Прочитать(Команда)
	
	Сообщения.Очистить();
	ОбъектныйСпособ_Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_ПотоковыйСпособ_Выгрузить(Команда)
	
	Сообщения.Очистить();
	ПотоковыйСпособ_Выгрузить();
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_ПотоковыйСпособ_Прочитать(Команда)
	
	Сообщения.Очистить();
	ПотоковыйСпособ_Прочитать();
	
КонецПроцедуры

#КонецОбласти
